{
    "name": "Abe",
    "identifying_info": {
        "age": 56,
        "gender": "male",
        "sexual_orientation": "heterosexual",
        "cultural_heritage": "American with European heritage",
        "religion": "Belongs to the Unitarian Church; was not attending church at intake",
        "living_environment": "Small apartment in large city, lives alone",
        "employment_status": "unemployed",
        "socioeconomic_status": "middle class"
    },
    "chief_complaint": "Abe sought treatment for severe depressive symptoms and moderate anxiety.",
    "major_symptoms": {
        "emotional": [
            "feelings of depression",
            "anxiety",
            "pessimism and some guilt",
            "lack of pleasure and interest"
        ],
        "cognitive": [
            "trouble making decisions",
            "trouble concentrating"
        ],
        "behavioral": [
            "avoidance (not cleaning up at home, looking for a job or doing errands)",
            "social isolation (stopped going to church, spent less time with family, stopped seeing friends)"
        ],
        "physiological": [
            "heaviness in body",
            "significant fatigue",
            "low libido",
            "difficulty relaxing",
            "decreased appetite"
        ]
    },
    "mental_status": "Abe appeared to be quite depressed. His clothes were somewhat wrinkled; he didn't stand or sit up straight and made little eye contact and didn't smile throughout the evaluation. His movements were a little slow. His speech was normal. He showed little affect other than depression. His thought process was intact. His sensorium, cognition, insight and judgment were within normal limits. He was able to fully participate in treatment.",
    "diagnosis": "Major Depressive Disorder, single episode, severe, with anxious distress. No personality disorder but mild OCPD features.",
    "current_psychiatric_treatment": {
        "medication": "none",
        "adherence_and_side_effects": "none"
    },
    "current_significant_relationships": "Although Abe had withdrawn somewhat from his family, his relationship with his two grown children and four school-age grandchildren were good. He sometimes visited them or attended his grandchildren's sporting events. He had a great deal of conflict with his ex-wife and he had completely withdrawn from his two male friends. He was relatively close to one cousin and less so to one brother. He saw and spoke to his other brother and his mother infrequently and didn't feel close to them.",
    "best_lifetime_functioning": "Abe was at his best when he finished high school, got a job, and moved into an apartment with a friend. This period lasted for about six years. He did well on the job, got along well with his supervisor and co-workers, socialized often with good friends, exercised and kept himself in good shape, and started saving money for the future. He was a good problem-solver, resourceful and resilient. He was respectful to others and pleasant to be around, often helping family and friends without being asked. He was hardworking both at work and around the house. He saw himself as competent, in control, reliable and responsible. He viewed others and his world as basically benign. His future seemed bright to him. He also functioned highly after thi time, though he had more stress in his life after he married and had children.",
    "history_of_present_illness": "Abe developed depressive and anxious symptoms 2 ½ years ago. His symptoms gradually worsened and turned into a major depressive episode about 2 years ago. Since that time, symptoms of depression and anxiety have remained consistently elevated without any periods of remission.",
    "history_of_psychological_problem_impact": "Abe became quite anxious about 2 ½ years ago when his supervisor changed his job responsibilities and provided him with inadequate training. He began to perceive himself as failing on the job and became depressed. His depression increased significantly when he lost his job six months later. He withdrew into himself and stopped many activities: helping around the house, doing yardwork and errands, seeing his friends. His wife then became highly critical and his depression became severe. He had not had any problems with alcohol or other substances",
    "history_of_psychological_care": "Abe and his wife had three joint outpatient marital counseling sessions with a social worker about 2 years ago; Abe reported it did not help. He reported no other previous treatment.",
    "personal_history": "Abe was the oldest of three sons. His father abandoned the family when Abe was eleven years old, and he never saw his father again. His mother then developed unrealistically high expectations for him, criticizing him severely for not consistently getting his younger brothers to do homework and for not cleaning up their apartment while she was at work. He had some conflict with his younger brothers who didn't like him 'bossing' them around. Abe always had a few good friends at school or in the neighborhood. After his father left, he developed a closer relationship with his maternal uncle and later with several of his coaches. Abe was an average student and a very good athlete. His highest level of education was a high school diploma. Abe started working in the construction industry in high school and had just a few jobs in the industry between graduation and when he became depressed. He worked his way up in customer service until he became a supervisor. He got along well with his bosses, supervisors and co-workers and had always received excellent evaluations until his most recent supervisor.",
    "medical_history_and_limitations": "Abe had a few sports-related injuries in high school but nothing major. His health was relatively good, except for moderately high blood pressure, which he developed in his late forties. He didn't have any physical limitations.",
    "current_non_psychiatric_treatment": {
        "medication": "Abe was taking Vasotec, 10 mg, 2x per day with full adherence to treat high blood pressure",
        "adherence_and_side_effects": "none"
    }
}