{
    "name": "Abe",
    "identifying_info": {
        "age": 56,
        "gender": "male",
        "sexual_orientation": "heterosexual",
        "cultural_heritage": "American with European heritage",
        "religion": "Belongs to the Unitarian Church; was not attending church at intake",
        "living_environment": "Small apartment in large city, lives alone",
        "employment_status": "unemployed",
        "socioeconomic_status": "middle class"
    },
    "chief_complaint": "Abe sought treatment for severe depressive symptoms and moderate anxiety.",
    "major_symptoms": {
        "emotional": [
            "feelings of depression",
            "anxiety",
            "pessimism and some guilt",
            "lack of pleasure and interest"
        ],
        "cognitive": [
            "trouble making decisions",
            "trouble concentrating"
        ],
        "behavioral": [
            "avoidance (not cleaning up at home, looking for a job or doing errands)",
            "social isolation (stopped going to church, spent less time with family, stopped seeing friends)"
        ],
        "physiological": [
            "heaviness in body",
            "significant fatigue",
            "low libido",
            "difficulty relaxing",
            "decreased appetite"
        ]
    },
    "mental_status": "Abe appeared to be quite depressed. His clothes were somewhat wrinkled; he didn't stand or sit up straight and made little eye contact and didn't smile throughout the evaluation. His movements were a little slow. His speech was normal. He showed little affect other than depression. His thought process was intact. His sensorium, cognition, insight and judgment were within normal limits. He was able to fully participate in treatment.",
    "diagnosis": "Major Depressive Disorder, single episode, severe, with anxious distress. No personality disorder but mild OCPD features.",
    "current_psychiatric_treatment": {
        "medication": "none",
        "adherence_and_side_effects": "none"
    },
    "current_significant_relationships": "Although Abe had withdrawn somewhat from his family, his relationship with his two grown children and four school-age grandchildren were good. He sometimes visited them or attended his grandchildren's sporting events. He had a great deal of conflict with his ex-wife and he had completely withdrawn from his two male friends. He was relatively close to one cousin and less so to one brother. He saw and spoke to his other brother and his mother infrequently and didn't feel close to them."
}